SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-45585-A

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( DR_BR_5XP_45585.s )
Size  ( 2.70m 4.0m 12.37m )
Mass ( 79.55t-uk )
WheelRadius ( 19.75in )comment (Front Bogie)

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Break ( 710kN 1220kN )
			r0 ( 10cm 0cm )
		)
		CouplingHasRigidConnection (1)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
Comment ( * Locomotive is steam braked * )
BrakeEquipmentType( "Vacuum_brake, Auxilary_reservoir" )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 218kN ) Comment ( * braked approx 70% of mass on driving wheels, or 55% of Weight in Working Order, coefficient of friction 0.5 * )

MaxReleaseRate ( 2.5inHg/s ) 
MaxApplicationRate ( 2.0inHg/s )

ORTSBrakeCylinderSize ( 6in ) Comment ( Locomotive has steam brake  )
ORTSAuxilaryResCapacity ( 0.90ft^3 ) Comment ( Vacuum reservoir used for control of steam brake )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.7m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 15.0ft 4.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 6375 )
ORTSDavis_B ( 26.6 )
ORTSDavis_C ( 5.449 )

ORTSWagonFrontalArea (102)
ORTSDavisDragConstant (0.0034)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights	( 2
			Light	(
			comment( Front White Lamp Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 0.99 1.39 5.69 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.55 )
					)
				)
			)
			Light	(
			comment( Front White Lamp Position D )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( -1.00 1.39 5.69 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.55 )
					)
				)
			)
		)
	

Comment( ******* Miscellaneous Wagon Information************ )

Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( DR_BR_5XP_45585.s )
        PassengerCabinHeadPos ( 1.423 3.2 -4.2 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound ("..\\..\\Common.Steam\\PatriotSound\\Patrioteng.sms" )
)

Engine ( OR-45585-A

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

   			WhistleFX
   			(
    			0.0 4.1 -4.15
    			0 -0.75 1
    			0.2
   			)
   			SafetyValvesFX
   			(
    			0 4 -3.035
    			0 1 0
    			0.4
   			)
   			StackFX
   			(
    			0 4.1 3.64
    			0 1 0
    			0.3
   			)

			DrainpipeFX
   			(
			-1.5 1.258 -3.886
			-0.4 -1 -0.2
			0.1
			)
			
			Injectors2FX
			(
				-1.1 0.8 -5.3
				0 -1 0
				0.15
			)
			Injectors1FX
			(
				1.1 0.85 -5.3
				0 -1 0
				0.15
			)
   			CylindersFX
   			(
    			-1.3 0.65 4.450
    			0 0 1
    			0.25
   			)

   			CylindersFX
   			(
    			1.3 0.65 4.450
    			0 0 1
    			0.25
   		)
  	)
 )

Wagon ( OR-45585-A )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 40.5in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 60t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 218ft^3 )  
ORTSEvaporationArea ( 1641ft^2 )
ORTSSuperheatArea ( 313ft^2 )
MaxBoilerPressure ( 225psi )
MaxSteamHeatingPressure ( 80psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 3 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 17in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13800btu/lb )comment(South Kirkby Coal)
ORTSGrateArea ( 31ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

MaxTenderCoalMass ( 9t-uk )
MaxTenderWaterMass ( 40000lb )
IsTenderRequired( 1 )	

ORTSWaterScoopFillElevation ( 2.8m )
ORTSWaterScoopDepth ( 3.0in ) Comment (* LNER standard scoop - depth varies depending on trough and area of operation *)
ORTSWaterScoopWidth ( 10.875in )


Comment(       ********ADVANCED PARAMETERS**********      )

ORTSBoilerEvaporationRate ( 17.5 )   
Comment(Set to acheive max steaming rate for 5XP Stanier boiler)

Comment(ORTSMaxIndicatedHorsepower ( 1580.0hp ))   

ORTSMaxSuperheatTemperature ( 270.0 )   
Comment(From Graph 17)

ORTSBoilerEfficiency( 0.0 0.94  198.0 0.47 )   
Comment(Estimated)

ORTSBurnRate( 0.0 10.0  9000.0 1000.0  15750.0 2000.0  18000.0 2500.0  20500.0 3000.0  23000.0 4000.0  25000.0 5000.0 25500.0  7000.0 )   Comment(From Graph 18)

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
BrakesEngineBrakeType ( "Steam_brake" )Comment(steam_brake crahes OR in Brake HUD)
TrainPipeLeakRate ( 0.05inHg/s )


Comment ( *** Ejectors *** )
Comment (  Estimate for Gresham & Craven SJ type P ejector  )
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.34inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 210lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 110psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )


Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Comment ( Locomotive brake based upon Gresham & Craven MkIV Steam Brake Valve )
Brake_Engine ( 0 1 0.25 0.0
NumNotches( 5
Notch( 0.00 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.25 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.50 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.75 0 EngineBrakesControllerBrakeNotchStart )
Notch( 1.00 0 EngineBrakesControllerBrakeNotchStart ) ) )


Comment ( Based upon Gresham & Craven SJ Ejector and control valve )
Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

ORTSSmallEjector ( 0 1 0.1 1.0 NumNotches ( 0 ) )

FireDoor ( 0 1 0.1 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( RS.cvf )
HeadOut (  -1.423 3.2 -4.2 )
Sound ("..\\..\\Common.Steam\\PatriotSound\\Patriotcab.sms" )
Name ( "45585 Jubilee HYDERABAD, Class A, Shed 17A Derby, TE 26.6Klbf" )
Description (
"The London Midland and Scottish Railway (LMS) Jubilee Class is a class of steam locomotive designed for main line passenger work. 191 locomotives were built between 1934 and 1936. They were built concurrently with the similar looking LMS Stanier Class 5 4-6-0. They were nicknamed Red Staniers (due to their crimson liveries) and Jubs.

The last five locomotives of Henry Fowler's Patriot class on order, 5552 to 5556, were built with William Stanier's taper boiler and so became the first of the Jubilee class. 113 locomotives were ordered straight from the drawing board. They were initially a disappointment; their moderate degree of superheating often left them short of steam. Changes to the blastpipe and chimney dimensions helped to transform them.

On 29 April 1935 no. 5552, the first of the class, permanently swapped identities with no. 5642 which had been named Silver Jubilee on 19 April 1935 in recognition of the Silver Jubilee of King George V on 6 May of that year. This change gave the name to the rest of the class, see LMS Jubilee Class 5552 Silver Jubilee. Earlier on (from summer 1934), they had been known as the Red Staniers (because of the crimson livery), to distinguish them from the Black Staniers (the LMS Stanier Class 5 4-6-0 class). These engines were named after former Commonwealth states and countries of the British Empire, British admirals, British naval commanders, and finally, ships in the British Navy named after characters from Greek Mythology.

Until the late 1950s, Jubilees were the largest express engine normally found on the lines running out of St Pancras. They practically monopolized the role of the main express engine, with the occasional Royal Scot popping up, or radiating from Derby. They could nevertheless be found on main lines throughout the former LMS system. They were also regarded as a powerful upgrade from both of the older Compound 4-4-0 locomotives, both the MR 1000 Class and the LMS Compound 4-4-0 as well. The Jubilees were a rather common sight on the Midland Main Line, the West Coast Main Line, and the Settle-Carlisle line, but were eventually displaced by the much more powerful Royal Scots during the 1940s.

The power classification was 5XP, in common with the earlier Patriot class.[5] In January 1951 the classification was revised to 6P and in November 1955 to 6P5F but this change was not applied to the locomotives' cabsides, which continued to show 6P.

These locomotives had a bit of a mixed reception during their early working days, but while their reputation did improve over time, they didn't reach the same amount of praise as the Black 5 locomotives. When the first members were built, the original 113 batch of engines to be precise, engine crews said that they were often disappointing. Crews often said that they were poor steamers and that the older locomotives that would be eventually replaced by them often performed better. However, once the problem with these engines was found and fixed after several extensive trials took place (the problem being that the diameter of the blast pipe was too large for the engines to make proper steam), the Jubilees went from being a theoretical success to an actual success thanks to some modifications."
)
)
